Revit 2026 API

# UIApplicationPostCommand Method

---

Posts the command to the Revit message queue to be invoked when control returns from the current API context.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void PostCommand(
	RevitCommandId commandId
)
```
```vb
Public Sub PostCommand (
	commandId As RevitCommandId
)
```
```cpp
public:
void PostCommand(
	RevitCommandId^ commandId
)
```
```fsharp
member PostCommand :
        commandId : RevitCommandId -> unit
```

#### Parameters

commandId RevitCommandId
     The command Id.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when commandId is . |
| ArgumentException | If the command cannot be posted. |
| InvalidOperationException | If there is a command already been posted. |

#### Reference

UIApplication Class

Autodesk.Revit.UI Namespace